spec/cassettes/Create_Payment/payment_failed/sends_an_email_to_the_customer.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_103bzo2Px4Wvfu2APLOs6F2V
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.10.1
      Authorization:
      - Bearer sk_test_fygJz3r147SBHwA8pOypeg7U
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.10.1","lang":"ruby","lang_version":"2.0.0 p353 (2013-11-22)","platform":"x86_64-darwin13.0.0","publisher":"stripe","uname":"Darwin
        josephs-mbp 13.1.0 Darwin Kernel Version 13.1.0: Thu Jan 16 19:40:37 PST 2014;
        root:xnu-2422.90.20~2/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 05 Mar 2014 21:09:49 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1406'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Cache-Control:
      - no-cache, no-store
      Access-Control-Max-Age:
      - '300'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_103bzo2Px4Wvfu2APLOs6F2V",
          "created": 1394052029,
          "livemode": false,
          "type": "charge.failed",
          "data": {
            "object": {
              "id": "ch_103bzo2Px4Wvfu2AFiYs8f1A",
              "object": "charge",
              "created": 1394052029,
              "livemode": false,
              "paid": false,
              "amount": 999,
              "currency": "usd",
              "refunded": false,
              "card": {
                "id": "card_103bzk2Px4Wvfu2AIea9QJeK",
                "object": "card",
                "last4": "0341",
                "type": "Visa",
                "exp_month": 3,
                "exp_year": 2019,
                "fingerprint": "cLTQIQTuD28cDlU9",
                "customer": "cus_3bcdc3Bt8RhLE1",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null
              },
              "captured": false,
              "refunds": [],
              "balance_transaction": null,
              "failure_message": "Your card was declined.",
              "failure_code": "card_declined",
              "amount_refunded": 0,
              "customer": "cus_3bcdc3Bt8RhLE1",
              "invoice": null,
              "description": "Test Fail",
              "dispute": null,
              "metadata": {}
            }
          },
          "object": "event",
          "pending_webhooks": 1,
          "request": "iar_3bzoaE6YEekuzY"
        }
    http_version: 
  recorded_at: Wed, 05 Mar 2014 21:09:49 GMT
recorded_with: VCR 2.8.0
